{"/BenchmarkIndex/bmIntro":{"title":"Bmintro","data":{"":"","introduction-to-the-benchmark-index#Introduction to the benchmark index":"","navigation-troubleshooting--important-information#Navigation, troubleshooting & important information":"IMPORTANTCurrencies displayed on report pages are *INTERNAL* costs. If information is shared with clients, it is crucial to apply the Goat margin or client-specific margin.","navigation-pages#Navigation Pages:":"The report is organised into pages (visible on the left-hand side).There are 4 main pages, Paid Performance, Paid Costings, Organic Performance, Organic Costings. These sections contain extensive information and allow users to search for specific benchmarks.For easier access, one default organic view has been created showcasing the most frequently used benchmarks with simplified filtering options.","visualizations#Visualizations:":"Each page contains various visualizations (charts, graphs, tables) that present data in different ways. Hovering your mouse over data points in the visualizations reveals more detailed information. Within each visualization you can also enter into Focus Mode available at the top right corner of each visual.","filters#Filters:":"The white boxes at the top of each page are filters. They act as filters for the data. Selecting a value in a filter (e.g., \"United Kingdom\" in the Location filter) will filter all visualizations on the current page to show only data related to that selection.\nYou can select multiple values in filters by holding down Ctrl/Cmd while clicking.\nClearing a filter selection with the eraser icon at the top will remove the selections on that filter.","interactivity#Interactivity:":"The report is interactive meaning that clicking on elements within a visualization (e.g., a bar in a bar chart) will filter other visualizations on the page, highlighting related data. This is called cross-filtering.","benchmarks-analyzed#Benchmarks Analyzed:":"The top right corner of each page displays a summary statistics displaying how many benchmarks are in use to generate the specific data you're looking at.","tooltips#Tooltips:":"Hover over each visual to reveal multiple tooltips. Ones that are extra useful areFocus Mode\nMakes your selected visual larger, useful where you have many data points.\n\nShow as Table\nBrings it into Focus Mode and displays the data in table format.","troubleshooting#Troubleshooting":"If you're unable to identify a specific option, check your filters. Applying filters limits the visible data. Each slicer has an eraser on the top right corner, use this to erase your selections.Resting all filters is achieved by clicking on the green arrow at the top right of the page. This defaults the view to the data range 1 year back in time with no other filters applied.If you have questions regarding the functionality or data, reach out to the team on the support channel on the slack Ibex support slack channel.For data queries please tag Ed Sparks, CJ Murray or Ben Kilby.\nFor functionality queries please tag Martin Leiva-Godoy."}},"/BenchmarkIndex/questions":{"title":"Questions","data":{"":"","what-type-of-questions-can-you-answer-with-this-data#What type of questions can you answer with this data?":"How do Lufthansa's key costing and performance metrics compare to those of its main competitors?\nAcross all of Tesco's campaigns in 2023, which vertical achieved the lowest CPE?\nWithin the food vertical, which influencer tier generally delivers the lowest CTR?\nFor US campaigns in 2023, in which quarter was the average CTR highest?\nAcross which social media platform did Audible achieve the highest average engagement rate?\nWhat is the median CPV for Instagram Reels vs Instagram Stories in the UK market?\nHow do the median CPM and CPE values compare across Sweden, Norway, Finland & Denmark?\nWhat was the median CPC for the EMEA region in 2023?\nFor a multi-territorial campaign, how should the budget be split to optimize both cost and performance?\nWhich platform has the highest hook rate for paid campaigns in the US?\nWhich optimization strategy yields the highest landing page view rate?"}},"/BenchmarkIndex/reportScenarios":{"title":"Reportscenarios","data":{"":"","report-pages-scenarios#Report Pages Scenarios":"As a default all pages are set to reflect the past year.Step 1. Select your Location.Step 2. Select your currency.","organic-costings--organic-performance-example#Organic Costings & Organic Performance Example:":"You're working with a client in the UK, in the lifestyle vertical. The primary KPI is to maximize Engagements.Start by selecting location to UK, currency to British Pound and vertical lifestyle.Metric Cost visuals will show you all available metrics, to get a more detailed overview you can apply Cost Per Engagement under the Metric slicer.The clustered column chart indicates that Instagram has the highest CPE at 9.84£, followed by TikTok at 5.79£ and the lowest CPE is for Youtube at 1.73£. You now need to apply the exact same filters to the organic performance page and analyze the performance.\"Looking at the metric performance visual you can see that TikTok has the highest ER at 3.65%, followed by 2.89% for Youtube and 1.25% for Instagram.","in-summary#In summary:":"For the highest ER, choose TikTok if your budget allows. If you have a limited budget Youtube should be considered to maximize total engagements for your spend. In this scenario, Instagram is generally less favorable due to its high cost and lower performance compared to the other two.","paid-costing--paid-performance-example#Paid Costing & Paid Performance Example:":"Coming Soon"}},"/CampaignSearch":{"title":"Campaign Search Documentation","data":{"":"","1-getting-started#1. Getting Started":"","logging-in-and-finding-campaign-search#Logging in and finding Campaign Search":"Campaign Search is situated within the Ibex 2.0 Dashboard, meaning you will need to log in using your Okta credentials to access the platform.Once logged in, head to the dashboard to find Campaign Search towards the bottom of the page.","what-is-campaign-search#What is Campaign Search?":"Campaign Search is your main access point for viewing all current and past campaigns that have been imported from campaign sheets.Many of you will have used the original Ibex platform, and may remember the previous version. The new Campaign Search acts as a successor to the original, adding usability and experience improvements, as well as increased functionality.","what-to-use-it-for#What to use it for?":"Use it to answer questions, get top level campaign information and direct links to the campaign sheet. Below are some examples of questions we have seeen in slack etc:\nWhat campaigns have we delivered for [Insert brand]?\nWhat campaigns have we worked on in [insert vertical]?\nWhich brands and campaigns have we executed in [insert territory]?\nWhat creators did we collaborate with on [insert campaign name or ID]?\nWhat brands and campaigns have we run within [insert product category]?\nHow many campaigns have we conducted between [date] and [date]?\n\nAll of the above can be answered quickly and easily using the available search box or via the filters.","2-exploring-campaigns#2. Exploring Campaigns":"","navigating-the-table-and-sidebar#Navigating the table and sidebar":"The campaign table displays key information about all current and past campaigns within Ibex. The table is sorted by default with the newest campaigns at the top.The table scrolls infinitely, so more campaigns will continue to appear as you scroll down. You can see the total number of results at the bottom left of the table area.Clicking on one of the table rows opens the sidebar, where you can find further details about the campaign, and a breakdown of the budget split, activations, and channels.The Overview, Activations and Channels sections of the sidebar","data-availability#Data Availability":"All of the data used within this feature has been taken from the campaign sheets, so most of it should be familiar to you. This includes the lists and categories available within filters, such as the product categories, product type, and Verticals.Some fields in the table and sidebar will be blank or displayed as unavailable. This is where data has either not been input into the campaign sheets, has failed to import due to a validation error or is planned to be updated and imported with future revisions of the campaign data, sheet importer or the new campaign setup process.","using-the-search-bar#Using the search bar":"The search bar lives above the campaign table and can be used in a couple of different ways:\nSearch for any non-numerical data e.g. brand, campaign name, territory, objective, vertical etc.\nSearch for a specific creator; this can be done using either the creator channel handle, the creator display name (eg Wendy Barker), or the creator's email address.\n\nThe search bar is most effective when used to quickly search for something specific (campaign name, campaign code, brand, or anything unique). For broader categories (beauty, brand awareness), it will not be as accurate as using the filtering system, as some terminology lives within multiple categories (e.g., beauty lives within verticals and product categories).","filtering-and-sorting#Filtering and sorting":"Many of the table columns have a sort function, denoted by the chevron icon to the right of a column header. By default, the table is sorted by date, most recent first.The filters can be accessed by pressing the filter button, to the right of the search bar. There are 11 filter groups, most of which contain 1 to 2 filters and an AND/OR toggle.\nAccess the 11 filter groups within the sidebar by using the filter button highlighted in blue.\nYou will see the table change dynamically as you apply filters within the sidebar.By default, within each filter section the AND/OR toggle is set to AND, meaning the results surfaced in the table will be a match for every filter you have applied.\nA filter block with the AND/OR toggle at it's default position\nKeep in mind that each filter applied can significantly reduce the amount of results surfaced, when AND is applied.If you wish to perform a broader search, where campaigns returned can be a partial match, you can set the toggle to OR for the variables you wish this to apply to.","4-user-feedback-process#4. User Feedback Process":"","how-to-submit-feedback#How to submit feedback":"There are three ways to submit feedback:\nFor general feedback and enquiries, email ibex.support@goatagency.com or use our ibex-support slack channel\nBug Report Form - for when you've encountered any bugs, or something's not working as expected\nProduct Feature Request Form - for new feature requests and suggestions on how to improve the platform","types-of-feedback-that-are-most-helpful#Types of feedback that are most helpful":"Giving a detailed description of the issue you faced, specifying where and how it happened, what device and browser you were using, and include steps to reproduce the error if possible. Include screenshots, sketches or supporting documentation where possible.\nReporting when data seems inaccurate, either within the campaign table or the sidebar (use the Bug Report Form)\nHighlighting any features or areas of the platform that are creating friction within your working process.\nA detailed explanation of a feature or update that will positively impact the team or improve the workflow/lifecycle of campaign strategy, planning, delivery and reporting.\nNew ideas or processes that are currently carried out by the team but could be improved through an addition or update to the\nHow feedback is processed\nTimeline for response/implementation\nHow to report bugs vs. suggest improvements","5-future-development-roadmap#5. Future Development Roadmap":"","planned-enhancements#Planned enhancements":"Display campaign sheet import errors\nButton for reimporting campaign sheet data\nRefinement of filter dropdown options\nInformation tooltips for filter descriptions","feature-prioritisation-process#Feature prioritisation process":"All bugs and feature requests are sent directly to the development and product team\n\nUrgent fixes are actioned as soon as possible\n\nAll other feedback and bugs are reviewed bi-weekly\n\nUpdates and fixes are published and sent out in the Ibex newsletter","how-user-feedback-influences-the-roadmap#How user feedback influences the roadmap":"All submissions and suggestions can influence the prioritisation and direction of the roadmap. We encourage everyone to share their frustrations, issues, and ideas. We thrive on this kind of feedback to ensure we provide you with the best possible experience. If the same or a similar issue arises frequently among many users, this will enhance the likelihood of prioritising topics planned for the next phase of work.While we will make every effort to consider, explore, and respond to suggestions, our small team works on updates, bugs, data, QA, integrations, and new product development, which means our capabilities are limited. If your suggestion is urgent or presents a significant impact, please submit the idea and contact us to discuss it further.","6-faq--troubleshooting#6. FAQ & Troubleshooting":"Frequently asked questions and answers\nSolutions for common issues\nTips for optimising performance\nKnown limitations and possible workarounds"}},"/DeliverablesCalc":{"title":"Deliverablescalc","data":{"":"","introduction#Introduction":"Search, filter and access historical campaigns.Coming soon"}},"/Industry&BrandInsights":{"title":"Industry&brandinsights","data":{"":""}},"/InfluencerSearch":{"title":"Influencersearch","data":{"":"","introduction#Introduction":"Use this application to search through our database of previously activated creators with performance insights and campaign informationCOMING SOON"}},"/PerformanceAnalyser":{"title":"Performanceanalyser","data":{"":"","1-introduction#1. Introduction":"The Performance Analyser is a tool designed to provide campaign insights for a campaign or brand across both organic and paid channels. It allows users to analyse influencer performance, CPMs, CPAs, engagement rates, and other key metrics. While initially conceived as a PCA data visualisation tool, its capabilities extend far beyond that.Key Features:\nFiltering by brand, campaign, platform, and post type.\nAdjustable time frame for data analysis.\nComparison of different post types (e.g., TikTok vs. Instagram Reels).\nCustom graph creation for comparing various metrics (e.g., CPA vs. Engagement Rate).\n\nUse Cases:\nAnalysing the performance of a specific campaign.\nComparing the performance of different influencers.\nIdentifying trends in engagement rates across different platforms.\nCreating data visualisations for PCA presentations.","2-getting-started#2. Getting Started":"Once you're logged in, click on the \"Performance Analyser\" card within the dashboard.Basic Workflow:\nFilter data by brand and campaign.\nAdjust the time frame as needed.\nFilter by platform and post type.\nAnalyse the data and create custom graphs as needed.","feature-1-campaign-code-filtering#Feature 1: Campaign Code Filtering":"This feature allows you to filter the data displayed by specific brands and campaigns.Steps:\nIn the \"Brand\" dropdown menu, select the desired brand. (Screenshot of the Brand dropdown)\nIn the \"Campaign\" dropdown menu, select the desired campaign. (Screenshot of the Campaign dropdown)\nThe data will be updated to display only the influencers and metrics associated with the selected brand and campaign.\n\nExample: To view data for the Mars Snickers' summer campaign:\nSelect \"Mars\" from the \"Brand\" dropdown.\nSelect \"Snickers Summer Campaign\" from the \"Campaign\" dropdown.\n\nBest Practices: Use this feature to focus your analysis on specific campaigns of interest.","feature-2-time-frame-adjustment#Feature 2: Time Frame Adjustment":"This feature allows you to adjust the time frame for the data displayed.Steps:\nUse the date picker to select a start date and end date. (Screenshot of the date picker)\nThe data will be updated to display only the influencers and metrics within the selected time frame.\n\nExample: To view data for the past year:\nSet the start date to one year ago from today.\nSet the end date to today.\n\nBest Practices: Adjust the time frame to identify trends over time.","feature-3-platform-and-post-type-filtering#Feature 3: Platform and Post Type Filtering":"This feature allows you to filter the data by platform (e.g., Instagram, TikTok) and post type (e.g., Reels, Posts).Steps:\nIn the \"Platform\" dropdown menu, select the desired platform. (Screenshot of the Platform dropdown)\nIn the \"Post Type\" dropdown menu, select the desired post type. (Screenshot of the Post Type dropdown)\nThe data will be updated to display only the influencers and metrics for the selected platform and post type.\n\nExample: To compare TikTok posts against Instagram Reels:\nSelect \"TikTok\" from the \"Platform\" dropdown and \"Posts\" from the \"Post Type\" dropdown.\nNote the performance metrics.\nSelect \"Instagram\" from the \"Platform\" dropdown and \"Reels\" from the \"Post Type\" dropdown.\nCompare the performance metrics.\n\nBest Practices: Use this feature to understand which platforms and post types are performing best for your campaigns.","feature-4-custom-graph-creation#Feature 4: Custom Graph Creation":"This feature allows you to create custom graphs to compare different metrics, such as CPA against engagement rate.Steps: (Detailed steps will depend on the specific implementation of the graph creation feature)\nClick on the \"Create Custom Graph\" button. (Screenshot of the button)\nSelect the metrics you want to compare from the available options. (Screenshot of the metric selection options)\nCustomize the graph settings (e.g., chart type, axis labels). (Screenshot of the graph settings)\nClick \"Generate Graph.\" (Screenshot of the button)\n\nExample: To create a graph comparing CPA against engagement rate:\nClick \"Create Custom Graph.\"\nSelect \"CPA\" as the X-axis metric.\nSelect \"Engagement Rate\" as the Y-axis metric.\nClick \"Generate Graph.\"\n\nBest Practices: Use custom graphs to visualize relationships between different metrics and identify areas for improvement.","3-example-scenarios#3. Example Scenarios":"","scenario-1-analyzing-influencer-performance-for-a-specific-campaign#Scenario 1: Analyzing Influencer Performance for a Specific Campaign:":"Select the relevant brand and campaign using the Campaign Code Filtering feature.\nReview the CPMs, CPAs, and engagement rates for each influencer.\nIdentify the top-performing influencers and analyze their content to understand what is working well.","scenario-2-comparing-platform-performance#Scenario 2: Comparing Platform Performance:":"Use the Platform and Post Type Filtering feature to compare the performance of different platforms (e.g., Instagram vs. TikTok).\nAnalyze the CPMs, CPAs, and engagement rates for each platform.\nIdentify which platforms are providing the best return on investment.","4-data-sensitivity--margin-considerations#4. Data Sensitivity & Margin Considerations":"The Performance Analyser handles sensitive data, including influencer CPMs, CPAs, and engagement rates. This data is primarily for internal use.\nImportant: The Performance Analyser handles sensitive data, including internal influencer and campaign cost pers. This data is for internal use without appropriate adjustments. Please ensure you have correct margins applied to any charts or data that you may use or show to clients.\nMargin: The default view displays data at a 0% margin.Client Communication: Be mindful of what information is shared with clients, especially in an undisclosed model where all data is based on internal costings without the correct margin applied. Always ensure the appropriate margin is applied before sharing costing data with clients.","5-exporting-charts-and-graphs#5. Exporting charts and graphs":"In order to export the charts and graphs from the performance analyser there are two requirements. A chrome extension that enables you to copy the SVG image of the chart and a design program to edit it. Our reccomendation is to use Figma as it makes it retains the proportions of the graph better than Adobe and there is a free tier that allows you to use the app with limited artboards.","where-to-get-the-apps#Where to get the apps":"You can download Figma from Kandji that should be available from your computer Figma on Kandji\nThe chrome extension required is SVG 2 ClipboardOnce you have these downlaoded and installed, navigate to the performance analyser and to the campaign or view you want the charts from.Make sure the extension is active and on the chart right click and select 'Copy SVG (element)'. This will copy the chart to your clipboard.In Figma create a new design document and paste the chart into the document. You now have a copy of your chart that can be edited. Some of the formatting will look a little odd but there are a few simple steps to resolve this outlined in the followign video,Video coming soon","6-troubleshooting--faqs#6. Troubleshooting & FAQs**":"Q: Why is the data not updating after I select a brand and campaign?A: Ensure that the selected brand and campaign have data available within the selected time frame.Q: How do I add a new metric to the custom graph creation feature?A: Contact the development team to request the addition of the new metric, provided the data is available in the system.","6-feedback--future-development#6. Feedback & Future Development":"The Performance Analyser is highly customizable. If there are any graphs or data points not currently accessible but needed, users can reach out to have those added, provided the data is in the system.Plans are in place to create a client portal where clients can log in and access their data, excluding some costing data. This feature will be particularly beneficial for long-term clients.The Performance Analyser is client-focused but internal facing for now, while the benchmark analysis provides industry-wide data over time. Using both together can provide powerful insights into how a brand is performing against industry standards."}},"/ResourceManagement":{"title":"Resourcemanagement","data":{"":"","introduction#Introduction":"Access to the the campaign overview Monday board to see all active campaigns and their status."}},"/ResourceRequest":{"title":"Resourcerequest","data":{"":"","introduction#Introduction":"These are typeforms that most of you will be familiar with as a part of your daily work. Now there all available in one place.Outside of the campaigh sheet request these resourses and forms are for the UK & US regions only."}},"/WorkflowPlatform":{"title":"Workflowplatform","data":{"":"","introduction#Introduction":"A quick link to the workflow platform for easy access to the familiar tools you need to access and manage your campaigns."}},"/":{"title":"Ibex User Documentation","data":{"":"Welcome to the Ibex dashboard documentation. Here you'll find comprehensive guides for using our suite of tools and applications. Learn how to manage campaigns effectively and make data-driven decisions using our powerful platform.","1-getting-started#1. Getting Started":"","logging-in#Logging In":"Navigate to Ibex Dashboard\nClick 'Login with Okta'\nEnter your WPP Okta credentials (same as your computer login)\nComplete the 2FA verification if prompted\nContact your administrator if you need help with access","dashboard-overview#Dashboard Overview":"Once logged in, you'll see the main dashboard - your central hub for all applications and services. Take time to explore the interface and available features. Note that:\nSome features contain sensitive cost data\nCertain services are only available in the UK and US regions\nEach tool has specific access permissions based on your role","2-support-and-training#2. Support and Training":"","available-resources#Available Resources":"Team training sessions for all key applications\nRegular documentation updates\nTeam support for specific questions\nTechnical assistance for any issues","ibex-support-channel#Ibex support channel":"Ibex support slack channel","feedback-and-improvements#Feedback and Improvements":"We continuously develop and enhance our applications based on your needs. Share your ideas through:\nDirect communication with your team lead\nVia the slack channel above\nUsing the forms available below\n\nWhether you've spotted a small bug or have a major feature request, we welcome all feedback to help improve the platform.Report a bug in the systemFeedback, Product requests, & UpdatesRequest a new user to be added to the systemWhether you've spotted a small bug or have a major feature request, we welcome all feedback to help improve the platform.Best regards,\nTeam Ibex"}}}