{"/BenchmarkIndex/bmIntro":{"title":"Introduction to the benchmark index","data":{"":"","navigation-troubleshooting--important-information#Navigation, troubleshooting & important information":"","important#IMPORTANT":"Currencies displayed on report pages are *INTERNAL* costs. If information is shared with clients, it is crucial to apply the Goat margin or client-specific margin.","navigation-pages#Navigation Pages:":"The report is organised into pages (visible on the left-hand side).There are 4 main pages, Paid Performance, Paid Costings, Organic Performance, Organic Costings. These sections contain extensive information and allow users to search for specific benchmarks.For easier access, one default organic view has been created showcasing the most frequently used benchmarks with simplified filtering options.","visualizations#Visualizations:":"Each page contains various visualizations (charts, graphs, tables) that present data in different ways. Hovering your mouse over data points in the visualizations reveals more detailed information. Within each visualization you can also enter into Focus Mode available at the top right corner of each visual.","slicers#Slicers:":"The white boxes at the top of each page are slicers. They act as filters for the data. Selecting a value in a slicer (e.g., \"United Kingdom\" in the Location slicer) will filter all visualizations on the current page to show only data related to that selection.\nYou can select multiple values in slicers by holding down Ctrl/Cmd while clicking.\nClearing a slicer selection with the eraser icon at the top will remove the selections on that slicer.","interactivity#Interactivity:":"The report is interactive meaning that clicking on elements within a visualization (e.g., a bar in a bar chart) will filter other visualizations on the page, highlighting related data. This is called cross-filtering.","benchmarks-analyzed#Benchmarks Analyzed:":"The top right corner of each page displays a summary statistics displaying how many benchmarks are in use to generate the specific data you're looking at.","tooltips#Tooltips:":"Hover over each visual to reveal multiple tooltips. Ones that are extra useful areFocus Mode\nMakes your selected visual larger, useful where you have many data points.\n\nShow as Table\nBrings it into Focus Mode and displays the data in table format.","troubleshooting#Troubleshooting":"If you're unable to identify a specific option, check your filters. Applying filters limits the visible data. Each slicer has an eraser on the top right corner, use this to erase your selections.Resting all filters is achieved by clicking on the green arrow at the top right of the page. This defaults the view to the data range 1 year back in time with no other filters applied.If you have questions regarding the Report functionality reach out to martin.leivagodoy@groupm.comIf you have questions regarding the data, reach out to x and x."}},"/BenchmarkIndex/questions":{"title":"Questions","data":{"":"","what-type-of-questions-can-you-answer-with-this-data#What type of questions can you answer with this data?":"How do Lufthansa's key costing and performance metrics compare to those of its main competitors?\nAcross all of Tesco's campaigns in 2023, which vertical achieved the lowest CPE?\nWithin the food vertical, which influencer tier generally delivers the lowest CTR?\nFor US campaigns in 2023, in which quarter was the average CTR highest?\nAcross which social media platform did Audible achieve the highest average engagement rate?\nWhat is the median CPV for Instagram Reels vs Instagram Stories in the UK market?\nHow do the median CPM and CPE values compare across Sweden, Norway, Finland & Denmark?\nWhat was the median CPC for the EMEA region in 2023?\nFor a multi-territorial campaign, how should the budget be split to optimize both cost and performance?\nWhich platform has the highest hook rate for paid campaigns in the US?\nWhich optimization strategy yields the highest landing page view rate?"}},"/BenchmarkIndex/reportScenarios":{"title":"Reportscenarios","data":{"":"","report-pages-scenarios#Report Pages Scenarios":"As a default all pages are set to reflect the past year.Step 1. Select your Location.Step 2. Select your currency.","organic-costings--organic-performance-example#Organic Costings & Organic Performance Example:":"You're working with a client in the UK, in the lifestyle vertical. The primary KPI is to maximize Engagements.Start by selecting location to UK, currency to British Pound and vertical lifestyle.Metric Cost visuals will show you all available metrics, to get a more detailed overview you can apply Cost Per Engagement under the Metric slicer.The clustered column chart indicates that Instagram has the highest CPE at 9.84£, followed by TikTok at 5.79£ and the lowest CPE is for Youtube at 1.73£. You now need to apply the exact same filters to the organic performance page and analyze the performance.\"Looking at the metric performance visual you can see that TikTok has the highest ER at 3.65%, followed by 2.89% for Youtube and 1.25% for Instagram.","in-summary#In summary:":"For the highest ER, choose TikTok if your budget allows. If you have a limited budget Youtube should be considered to maximize total engagements for your spend. In this scenario, Instagram is generally less favorable due to its high cost and lower performance compared to the other two.","paid-costing--paid-performance-example#Paid Costing & Paid Performance Example:":"Coming Soon"}},"/CampaignSearch":{"title":"Campaignsearch","data":{"":"","campaign-search#Campaign Search":"Search, filter and access historical campaigns.Coming soon"}},"/DeliverablesCalc":{"title":"Deliverablescalc","data":{"":"","deliverables-calculator#Deliverables Calculator":"Search, filter and access historical campaigns.Coming soon"}},"/Industry&BrandInsights":{"title":"Industry&brandinsights","data":{"":""}},"/InfluencerSearch":{"title":"Influencersearch","data":{"":"","influencer-search#Influencer Search":"Use this application to search through our database of previously activated creators with performance insights and campaign informationCOMING SOON"}},"/PerformanceAnalyser":{"title":"Performanceanalyser","data":{"":"","performance-analyser#Performance Analyser":"","introduction#Introduction":"Gain campaign insights for a campaign or brand across organic and paid.Initially intended as a PCA data visualisation tool. While this is absolutly what it can be used for its capabilities go far beyond just that.The Performance Analyser is a tool designed to handle and analyze sensitive data, including information about influencers Cost Per Mille (CPMs), Cost Per Action (CPAs), engagement rates, etc. This data is primarily for internal use, with an automatic 0% margin setting.It's important to be mindful of what information is shared with clients, especially in an undisclosed model where all data is based on internal costings without the correct margin applied.The default view displays campaign codes from the past six months at a 0% margin. Users can filter this data by different brands and campaigns, such as the Mars Snickers' summer campaign. The application then pulls through all the influencers that the brand has engaged with over the selected time frame, providing insights on CPMs against engagement rate, impressions, and other metrics.The application allows users to adjust the time frame beyond six months and filter data by platform and post types. It also enables comparison of different post types, like TikTok posts against Instagram reels, providing a comprehensive understanding of campaign performance.Additionally ther is the option to create custom graphs, enabling users to compare different metrics like CPA against the engagement rate. This feature makes it easier to pull data into a PCA.The Performance Analyser application is highly customizable. If there are any graphs or data points not currently accessible but needed, users can reach out to have those added, provided the data is in the system.The Performance Analyser is client-focused, while the benchmark analysis provides industry-wide data over time. Using both together can provide powerful insights into how a brand is performing against industry standards. In the future, there are plans to create a client portal where clients can log in and access their data, excluding some costing data. This feature will be particularly beneficial for long-term clients."}},"/ResourceManagement":{"title":"Resourcemanagement","data":{"":"","resource-management#Resource Management":"","introduction#Introduction":"Access to the the campaign overview Monday board to see all active campaigns and their status."}},"/ResourceRequest":{"title":"Resourcerequest","data":{"":"","resource-request#Resource Request":"","introduction#Introduction":"These are typeforms that most of you will be familiar with as a part of your daily work. Now there all available in one place.Outside of the campaigh sheet request these resourses and forms are for the UK & US regions only."}},"/WorkflowPlatform":{"title":"Workflowplatform","data":{"":"","workflow-platform#Workflow Platform":"","introduction#Introduction":"A quick link to the workflow platform for easy access to the familiar tools you need to access and manage your campaigns."}},"/":{"title":"Ibex User Documentation","data":{"":"Welcome to the Ibex dashboard documentation. Here you'll find comprehensive guides for using our suite of tools and applications. Learn how to manage campaigns effectively and make data-driven decisions using our powerful platform.","1-getting-started#1. Getting Started":"","logging-in#Logging In":"Navigate to Ibex Dashboard\nClick 'Login with Okta'\nEnter your WPP Okta credentials (same as your computer login)\nComplete the 2FA verification if prompted\nContact your administrator if you need help with access","dashboard-overview#Dashboard Overview":"Once logged in, you'll see the main dashboard - your central hub for all applications and services. Take time to explore the interface and available features. Note that:\nSome features contain sensitive cost data\nCertain services are only available in the UK and US regions\nEach tool has specific access permissions based on your role","2-support-and-training#2. Support and Training":"","available-resources#Available Resources":"Team training sessions for all key applications\nRegular documentation updates\nTeam support for specific questions\nTechnical assistance for any issues","ibex-support-channel#Ibex support channel":"Join Ibex support slack channel","feedback-and-improvements#Feedback and Improvements":"We continuously develop and enhance our applications based on your needs. Share your ideas through:\nSubmit Feedback via Google Forms\nDirect communication with your team lead\nVia the slack channel above\n\nWhether you've spotted a small bug or have a major feature request, we welcome all feedback to help improve the platform.Best regards,\nTeam Ibex"}}}