{"/BenchmarkIndex/bmIntro":{"title":"Introduction to the benchmark index","data":{"":"","navigation-troubleshooting--important-information#Navigation, troubleshooting & important information":"","important#IMPORTANT":"Currencies displayed on report pages are *INTERNAL* costs. If information is shared with clients, it is crucial to apply the Goat margin or client-specific margin.","navigation-pages#Navigation Pages:":"The report is organised into pages (visible on the left-hand side).There are 4 main pages, Paid Performance, Paid Costings, Organic Performance, Organic Costings. These sections contain extensive information and allow users to search for specific benchmarks.For easier access, one default organic view has been created showcasing the most frequently used benchmarks with simplified filtering options.","visualizations#Visualizations:":"Each page contains various visualizations (charts, graphs, tables) that present data in different ways. Hovering your mouse over data points in the visualizations reveals more detailed information. Within each visualization you can also enter into Focus Mode available at the top right corner of each visual.","slicers#Slicers:":"The white boxes at the top of each page are slicers. They act as filters for the data. Selecting a value in a slicer (e.g., \"United Kingdom\" in the Location slicer) will filter all visualizations on the current page to show only data related to that selection.\nYou can select multiple values in slicers by holding down Ctrl/Cmd while clicking.\nClearing a slicer selection with the eraser icon at the top will remove the selections on that slicer.","interactivity#Interactivity:":"The report is interactive meaning that clicking on elements within a visualization (e.g., a bar in a bar chart) will filter other visualizations on the page, highlighting related data. This is called cross-filtering.","benchmarks-analyzed#Benchmarks Analyzed:":"The top right corner of each page displays a summary statistics displaying how many benchmarks are in use to generate the specific data you're looking at.","tooltips#Tooltips:":"Hover over each visual to reveal multiple tooltips. Ones that are extra useful areFocus Mode\nMakes your selected visual larger, useful where you have many data points.\n\nShow as Table\nBrings it into Focus Mode and displays the data in table format.","troubleshooting#Troubleshooting":"If you're unable to identify a specific option, check your filters. Applying filters limits the visible data. Each slicer has an eraser on the top right corner, use this to erase your selections.Resting all filters is achieved by clicking on the green arrow at the top right of the page. This defaults the view to the data range 1 year back in time with no other filters applied.If you have questions regarding the Report functionality reach out to martin.leivagodoy@groupm.comIf you have questions regarding the data, reach out to x and x."}},"/InfluencerSearch/InfluSearch":{"title":"Influsearch","data":{"":"","influencer-search#Influencer Search":"Use this application to search through our database of previously activated creators with performance insights and campaign information"}},"/":{"title":"Ibex User Documentation","data":{"":"Welcome to the Ibex dashboard documentation. Here you'll find comprehensive guides for using our suite of tools and applications. Learn how to manage campaigns effectively and make data-driven decisions using our powerful platform.","1-getting-started#1. Getting Started":"","logging-in#Logging In":"Navigate to Ibex Dashboard\nClick 'Login with Okta'\nEnter your WPP Okta credentials (same as your computer login)\nComplete the 2FA verification if prompted\nContact your administrator if you need help with access","dashboard-overview#Dashboard Overview":"Once logged in, you'll see the main dashboard - your central hub for all applications and services. Take time to explore the interface and available features. Note that:\nSome features contain sensitive cost data\nCertain services are only available in the UK and US regions\nEach tool has specific access permissions based on your role","2-support-and-training#2. Support and Training":"","available-resources#Available Resources":"Team training sessions for all key applications\nRegular documentation updates\nTeam support for specific questions\nTechnical assistance for any issues","feedback-and-improvements#Feedback and Improvements":"We continuously develop and enhance our applications based on your needs. Share your ideas through:\nThe feedback form below\nDirect communication with your team lead\nMonthly improvement workshops\n\nWhether you've spotted a small bug or have a major feature request, we welcome all feedback to help improve the platform.Best regards,\nTeam Ibex"}}}