{"/BenchmarkExplorer/benchmark":{"title":"Benchmark","data":{"":"Text\n22"}},"/BenchmarkIndex/Benchmark":{"title":"Benchmark","data":{"":""}},"/InfluencerSearch/InfluSearch":{"title":"Influsearch","data":{"":"","influencer-search#Influencer Search":"Use this application to search through our database of previously activated creators"}},"/":{"title":"Ibex User Documentation - 2024 V2.0.0","data":{"":"IntroductionThese documents provide a guide to using the Ibex app dashboard and the tools contained within it. Covering key features, use cases and how to use the applications, outlining common questions and workflows to help you effectively manage your campaigns and leverage our data to make effective data-backed decisions in campaign planning and activation.","1-getting-started#1. Getting Started":"Logging In:\nAccess the Ibex dashboard by navigating to https://ibex.goatagency.com/dashboard in your web browser. Select 'Login with Okta' and enter your username and password credentials that you use to access your computer or any WPP Okta 2FA applications or services, then click \"Login\". Contact your administrator if you have forgotten your credentials.\nDashboard Overview: Upon successful login, you'll be presented with the main dashboard. This is the entry point for all the available apps, services and resources. Familiarise yourself with the layout and available information. Some features contain sensitive cost data the should be used with care alongside services are only available in certain regions namley UK and US.","what-to-expect#What to expect":"As the initial release of these apps there will be a learning curve to effectivly use these apps. Traning will be provided but please do reach out to the teams for support if you are in doubt of how to utalise the apps or if you have any quesions or suggestions.These are internally developed apps and tools that have been designed with the best available knowledge and understanding for how they could be used. We accept and understand that the reality of using these may be different in real world use. We have control over the ongoing development and roadmap and are always open to ideas and suggestions of how we can improve or introduce new initiatives. Our teams are here to support the evaluation and implementation of improvments, bug fixes, updates or new ideas.You can submit your suggestions or ideas using the form below. Weather this is a small bug fix or a big idea we want to hear it.Also, everything is saved in a GitHub repository, so we can easily make changes and collaborate on the documentation."}}}